FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX200_RX231-RSK_GCC_e2studio_IAR/src/iodefine.h
struct st_sdhi {
	union {
		unsigned long LONG;
//		struct {
//			unsigned long :16;
//			unsigned long CMD12AT:2;
//			unsigned long TRSTP:1;
//			unsigned long CMDRW:1;
//			unsigned long CMDTP:1;
//			unsigned long RSPTP:3;
//			unsigned long ACMD:2;
//			unsigned long CMDIDX:6;
//		} BIT;
	} SDCMD;
	char           wk0[4];
	unsigned long  SDARG;
	char           wk1[4];
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long STP : 1;
			unsigned long  : 7;
			unsigned long SDBLKCNTEN : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long SDBLKCNTEN : 1;
			unsigned long  : 7;
			unsigned long STP : 1;
#endif
	} BIT;
	} SDSTOP;
	unsigned long  SDBLKCNT;
	unsigned long  SDRSP10;
	char           wk2[4];
	unsigned long  SDRSP32;
	char           wk3[4];
	unsigned long  SDRSP54;
	char           wk4[4];
	unsigned long  SDRSP76;
	char           wk5[4];
	union {
		unsigned long LONG;
//		struct {
//			unsigned long :21;
//			unsigned long SDD3MON:1;
//			unsigned long SDD3IN:1;
//			unsigned long SDD3RM:1;
//			unsigned long SDWPMON:1;
//			unsigned long :1;
//			unsigned long SDCDMON:1;
//			unsigned long SDCDIN:1;
//			unsigned long SDCDRM:1;
//			unsigned long ACEND:1;
//			unsigned long :1;
//			unsigned long RSPEND:1;
//		} BIT;
	} SDSTS1;
	union {
		unsigned long LONG;
//		struct {
//			unsigned long :16;
//			unsigned long ILA:1;
//			unsigned long CBSY:1;
//			unsigned long SDCLKCREN:1;
//			unsigned long :3;
//			unsigned long BWE:1;
//			unsigned long BRE:1;
//			unsigned long SDD0MON:1;
//			unsigned long RSPTO:1;
//			unsigned long ILR:1;
//			unsigned long ILW:1;
//			unsigned long DTO:1;
//			unsigned long ENDE:1;
//			unsigned long CRCE:1;
//			unsigned long CMDE:1;
//		} BIT;
	} SDSTS2;
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RSPENDM : 1;
			unsigned long  : 1;
			unsigned long ACENDM : 1;
			unsigned long SDCDRMM : 1;
			unsigned long SDCDINM : 1;
			unsigned long  : 3;
			unsigned long SDD3RMM : 1;
			unsigned long SDD3INM : 1;
			unsigned long  : 22;
#else
			unsigned long  : 22;
			unsigned long SDD3INM : 1;
			unsigned long SDD3RMM : 1;
			unsigned long  : 3;
			unsigned long SDCDINM : 1;
			unsigned long SDCDRMM : 1;
			unsigned long ACENDM : 1;
			unsigned long  : 1;
			unsigned long RSPENDM : 1;
#endif
	} BIT;
	} SDIMSK1;
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CMDEM : 1;
			unsigned long CRCEM : 1;
			unsigned long ENDEM : 1;
			unsigned long DTTOM : 1;
			unsigned long ILWM : 1;
			unsigned long ILRM : 1;
			unsigned long RSPTOM : 1;
			unsigned long  : 1;
			unsigned long BREM : 1;
			unsigned long BWEM : 1;
			unsigned long  : 5;
			unsigned long ILAM : 1;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long ILAM : 1;
			unsigned long  : 5;
			unsigned long BWEM : 1;
			unsigned long BREM : 1;
			unsigned long  : 1;
			unsigned long RSPTOM : 1;
			unsigned long ILRM : 1;
			unsigned long ILWM : 1;
			unsigned long DTTOM : 1;
			unsigned long ENDEM : 1;
			unsigned long CRCEM : 1;
			unsigned long CMDEM : 1;
#endif
	} BIT;
	} SDIMSK2;
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CLKSEL : 8;
			unsigned long CLKEN : 1;
			unsigned long CLKCTRLEN : 1;
			unsigned long  : 22;
#else
			unsigned long  : 22;
			unsigned long CLKCTRLEN : 1;
			unsigned long CLKEN : 1;
			unsigned long CLKSEL : 8;
#endif
	} BIT;
	} SDCLKCR;
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LEN : 10;
			unsigned long  : 22;
#else
			unsigned long  : 22;
			unsigned long LEN : 10;
#endif
	} BIT;
	} SDSIZE;
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CTOP : 4;
			unsigned long TOP : 4;
			unsigned long  : 7;
			unsigned long WIDTH : 1;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long WIDTH : 1;
			unsigned long  : 7;
			unsigned long TOP : 4;
			unsigned long CTOP : 4;
#endif
	} BIT;
	} SDOPT;
	char           wk6[4];
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CMDE0 : 1;
			unsigned long CMDE1 : 1;
			unsigned long RSPLENE0 : 1;
			unsigned long RSPLENE1 : 1;
			unsigned long RDLENE : 1;
			unsigned long CRCLENE : 1;
			unsigned long  : 2;
			unsigned long RSPCRCE0 : 1;
			unsigned long RSPCRCE1 : 1;
			unsigned long RDCRCE : 1;
			unsigned long CRCTKE : 1;
			unsigned long CRCTK : 3;
			unsigned long  : 17;
#else
			unsigned long  : 17;
			unsigned long CRCTK : 3;
			unsigned long CRCTKE : 1;
			unsigned long RDCRCE : 1;
			unsigned long RSPCRCE1 : 1;
			unsigned long RSPCRCE0 : 1;
			unsigned long  : 2;
			unsigned long CRCLENE : 1;
			unsigned long RDLENE : 1;
			unsigned long RSPLENE1 : 1;
			unsigned long RSPLENE0 : 1;
			unsigned long CMDE1 : 1;
			unsigned long CMDE0 : 1;
#endif
	} BIT;
	} SDERSTS1;
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RSPTO0 : 1;
			unsigned long RSPTO1 : 1;
			unsigned long BSYTO0 : 1;
			unsigned long BSYTO1 : 1;
			unsigned long RDTO : 1;
			unsigned long CRCTO : 1;
			unsigned long CRCBSYTO : 1;
			unsigned long  : 25;
#else
			unsigned long  : 25;
			unsigned long CRCBSYTO : 1;
			unsigned long CRCTO : 1;
			unsigned long RDTO : 1;
			unsigned long BSYTO1 : 1;
			unsigned long BSYTO0 : 1;
			unsigned long RSPTO1 : 1;
			unsigned long RSPTO0 : 1;
#endif
	} BIT;
	} SDERSTS2;
	unsigned long  SDBUFR;
	char           wk7[4];
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long INTEN : 1;
			unsigned long  : 1;
			unsigned long RWREQ : 1;
			unsigned long  : 5;
			unsigned long IOABT : 1;
			unsigned long C52PUB : 1;
			unsigned long  : 22;
#else
			unsigned long  : 22;
			unsigned long C52PUB : 1;
			unsigned long IOABT : 1;
			unsigned long  : 5;
			unsigned long RWREQ : 1;
			unsigned long  : 1;
			unsigned long INTEN : 1;
#endif
	} BIT;
	} SDIOMD;
	union {
		unsigned long LONG;
//		struct {
//			unsigned long :16;
//			unsigned long EXWT:1;
//			unsigned long EXPUB52:1;
//			unsigned long :13;
//			unsigned long IOIRQ:1;
//		} BIT;
	} SDIOSTS;
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IOIRQM : 1;
			unsigned long  : 13;
			unsigned long EXPUB52M : 1;
			unsigned long EXWTM : 1;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long EXWTM : 1;
			unsigned long EXPUB52M : 1;
			unsigned long  : 13;
			unsigned long IOIRQM : 1;
#endif
	} BIT;
	} SDIOIMSK;
	char           wk8[316];
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long DMAEN : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long DMAEN : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} SDDMAEN;
	char           wk9[12];
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SDRST : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long SDRST : 1;
#endif
	} BIT;
	} SDRST;
	char           wk10[28];
	union {
		unsigned long LONG;
		struct {

#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 6;
			unsigned long BWSWP : 1;
			unsigned long BRSWP : 1;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long BRSWP : 1;
			unsigned long BWSWP : 1;
			unsigned long  : 6;
#endif
	} BIT;
	} SDSWAP;
};

